# 3)Рост дочерей 175, 167, 154, 174, 178, 148, 160, 167, 169, 170
# Рост матерей  178, 165, 165, 173, 168, 155, 160, 164, 178, 175
# Используя эти данные построить 95% доверительный интервал для разности среднего роста 
# родителей и детей.

import numpy as np
from scipy import stats

x1 = np.array([175, 167, 154, 174, 178, 148, 160, 167, 169, 170])
x2 = np.array([178, 165, 165, 173, 168, 155, 160, 164, 178, 175])
alfa = 0.05

m1 = np.mean(x1) # 166.2 
m2 = np.mean(x2) # 168.1
delta = m1 - m2 # -1.9
print(m1, m2, delta)
D1 = np.var(x1) # 81.96
D2 = np.var(x2) # 54.09
D = (D1 + D2)/2 # 68.025
SE = np.sqrt(D/len(x1) + D/len(x2)) # 3.6885
t = stats.t.ppf(1-alfa/2, 2*(len(x1)-1)) # 2.1009
print(D1, D2, D, SE, t)

print(delta - t * SE, delta + t * SE) # -9.6492 5.8492

# С вероятностью 95% разность среднего роста дочерей и матерей находится в интервале (-9.6492; 5.8492)